#include<iostream>

int main() {

	{//Завдання 1:
		int arr[6];

		for (int i = 0; i < 6; i++)//перебираємо значення від 0 до 5 (6 не включно)
		{
			if (i % 2 == 0)//перевірка індекса і на парність
			{
				arr1[i] = 23 + i;
			}
			else //перевірка індекса і на непарність
			{
				arr1[i] = 25 - i;
			}
		}

		int size = 6;
		for (int i = 0; i < size - 1; i++)// визначаємо кількість проходів по масиву, для 6 елементів кількість проходів буде 5
		{
			for (int j = 0; j < size - i - 1; j++)// перебираємо елементи в масиві
			{
				if (arr1[j] > arr1[j + 1])//якщо лівий елемент більший за правий, то міняємо їх місцями
				{
					int temp = arr1[j];
					arr1[j] = arr1[j + 1];
					arr1[j + 1] = temp;
				}
			}
		}
	}
	{//Завдання 2:
		int arr1[10];
		int arr2[10];
		int arr3[10];

		//заповнюємо перший масив
		for (int i = 0; i < 10; i++) {
			arr1[i] = 62 + 3 * i;
		}
		//заповнюємо другий масив
		for (int i = 0; i < 10; i++)
		{
			arr2[i] = 37 + i;
		}

		//Ініціювання третьої змінної рівними значеннями двох попередніх змінних
		int k = 0; // кількість рівних значень в першому та другому масивах
		for (int i = 0; i < 10; i++)//зовнішній цикл, прохід по першому масиву
		{
			for (int j = 0; j < 10; j++)//внутрішній цикл, прохід по другому масиву
			{
				if (arr1[i] == arr2[j])//перевірка на рівність значень в першому та другому масивах
				{
					arr3[k] = arr1[i];//присвоєння значення третьому масиву, яке співпало в перших двох масивах
					k++;//збільшення кількості рівних значень
					break;// вихід з внутрішнього циклу
				}
			}
		}

		if (k == 0) {
			cout << "No common elements" << endl;
		}
		else {
			cout << "Common elements: ";//виводимо спільні елементи, якщо вони є
			for (int i = 0; i < k; i++) {
				cout << arr3[i] << " ";
			}
			cout << endl;
		}

		//Знайдемо суму кодів мінімального та максимального елементів
		int sum = 0;//задаємо початкове значення для суми елементів
		int minValue = arr3[0];
		int maxValue = arr3[0];
		for (int i = 1; i < k; i++)//перебираємо елементи в третьому масиві
		{
			if (arr3[i] < minValue)//перевіряємо, що значення елемента менше за minValue
			{
				minValue = arr3[i];

			}
			else if (arr3[i] > maxValue) {
				maxValue = arr3[i];
			}
		}

		sum = minValue + maxValue;
		cout << "minValue: " << minValue << endl;
		cout << "maxValue: " << maxValue << endl;
		cout << "Sum : " << sum << endl;


	}
}